---
kind: enumMember
id: F:Autodesk.Revit.DB.ValueAtPointFlags.DisplayFence
enum: Autodesk.Revit.DB.ValueAtPointFlags
source: html/7b08366e-61ca-caec-c097-173137ba48c5.htm
---
# Autodesk.Revit.DB.ValueAtPointFlags.DisplayFence

Show fence for the point if allowed by display style (applies only to diagram display style)